<a href="https://colab.research.google.com/github/KotagiriRohan/Titanic_Machine_Learning/blob/main/Titanic_Logistic_Regresion.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [63]:
import pandas as pd
import numpy as np
import seaborn as sns
from matplotlib import pyplot as plt
from sklearn.impute import SimpleImputer
from sklearn.linear_model import LogisticRegression

In [64]:
train_df = pd.read_csv('/content/titanic_train.csv')
test_df = pd.read_csv('/content/titanic_test.csv')
y_true = pd.read_csv('/content/gender_submission.csv')


train_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [65]:
train_df.drop(['PassengerId', 'Ticket', 'Cabin'],axis=1 ,inplace=True)
train_df["Family_size"] = train_df["SibSp"]+train_df["Parch"]
train_df.drop(['Parch','SibSp'], axis=1, inplace=True)

In [66]:
train_df.head(15)

    Survived  Pclass  ... Embarked Family_size
0          0       3  ...        S           1
1          1       1  ...        C           1
2          1       3  ...        S           0
3          1       1  ...        S           1
4          0       3  ...        S           0
5          0       3  ...        Q           0
6          0       1  ...        S           0
7          0       3  ...        S           4
8          1       3  ...        S           2
9          1       2  ...        C           1
10         1       3  ...        S           2
11         1       1  ...        S           0
12         0       3  ...        S           0
13         0       3  ...        S           6
14         0       3  ...        S           0

[15 rows x 8 columns]

In [69]:
train_df["Title"] = train_df['Name'].str.extract(' ([A-Za-z]+)\.', expand = False)
train_df.drop(["Name"],axis=1 ,inplace=True)

In [70]:
train_df.head()

   Survived  Pclass     Sex   Age     Fare Embarked  Family_size Title
0         0       3    male  22.0   7.2500        S            1    Mr
1         1       1  female  38.0  71.2833        C            1   Mrs
2         1       3  female  26.0   7.9250        S            0  Miss
3         1       1  female  35.0  53.1000        S            1   Mrs
4         0       3    male  35.0   8.0500        S            0    Mr

In [71]:
train_df.isna().sum()

Survived         0
Pclass           0
Sex              0
Age            177
Fare             0
Embarked         2
Family_size      0
Title            0
dtype: int64

In [72]:
train_df.dropna(subset=['Embarked'], inplace=True)

In [73]:
train_df.isna().sum()

Survived         0
Pclass           0
Sex              0
Age            177
Fare             0
Embarked         0
Family_size      0
Title            0
dtype: int64

In [74]:
for col in ["Embarked","Sex","Title"]:
    train_df[col], _= train_df[col].factorize()

In [75]:
train_df.head()

   Survived  Pclass  Sex   Age     Fare  Embarked  Family_size  Title
0         0       3    0  22.0   7.2500         0            1      0
1         1       1    1  38.0  71.2833         1            1      1
2         1       3    1  26.0   7.9250         0            0      2
3         1       1    1  35.0  53.1000         0            1      1
4         0       3    0  35.0   8.0500         0            0      0

In [76]:
imputer = SimpleImputer(missing_values=np.nan, strategy='mean')
train_df[['Age']] = imputer.fit_transform(train_df[['Age']])

In [77]:
train_df.isna().sum()

Survived       0
Pclass         0
Sex            0
Age            0
Fare           0
Embarked       0
Family_size    0
Title          0
dtype: int64

In [79]:
passenger = test_df['PassengerId']
test_df.drop(['PassengerId', 'Ticket', 'Cabin'],axis=1 ,inplace=True)
test_df["Family_size"] = test_df["SibSp"]+test_df["Parch"]
test_df.drop(['Parch','SibSp'], axis=1, inplace=True)

KeyError: ignored

In [80]:
test_df.head()

   Pclass                                          Name  ... Embarked  Family_size
0       3                              Kelly, Mr. James  ...        Q            0
1       3              Wilkes, Mrs. James (Ellen Needs)  ...        S            1
2       2                     Myles, Mr. Thomas Francis  ...        Q            0
3       3                              Wirz, Mr. Albert  ...        S            0
4       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  ...        S            2

[5 rows x 7 columns]

In [81]:
test_df["Title"] = test_df['Name'].str.extract(' ([A-Za-z]+)\.', expand = False)
test_df.drop(["Name"],axis=1 ,inplace=True)

In [82]:
test_df.head()

   Pclass     Sex   Age     Fare Embarked  Family_size Title
0       3    male  34.5   7.8292        Q            0    Mr
1       3  female  47.0   7.0000        S            1   Mrs
2       2    male  62.0   9.6875        Q            0    Mr
3       3    male  27.0   8.6625        S            0    Mr
4       3  female  22.0  12.2875        S            2   Mrs

In [83]:
for col in ["Embarked","Sex","Title"]:
    test_df[col], _= test_df[col].factorize()

In [84]:
test_df.head()

   Pclass  Sex   Age     Fare  Embarked  Family_size  Title
0       3    0  34.5   7.8292         0            0      0
1       3    1  47.0   7.0000         1            1      1
2       2    0  62.0   9.6875         0            0      0
3       3    0  27.0   8.6625         1            0      0
4       3    1  22.0  12.2875         1            2      1

In [85]:
test_df.isna().sum()

Pclass          0
Sex             0
Age            86
Fare            1
Embarked        0
Family_size     0
Title           0
dtype: int64

In [86]:
test_df[["Age","Fare"]] = imputer.fit_transform(test_df[["Age","Fare"]])

In [87]:
test_df.isna().sum()

Pclass         0
Sex            0
Age            0
Fare           0
Embarked       0
Family_size    0
Title          0
dtype: int64

In [88]:
test_df.head()

   Pclass  Sex   Age     Fare  Embarked  Family_size  Title
0       3    0  34.5   7.8292         0            0      0
1       3    1  47.0   7.0000         1            1      1
2       2    0  62.0   9.6875         0            0      0
3       3    0  27.0   8.6625         1            0      0
4       3    1  22.0  12.2875         1            2      1

In [89]:
X_train = train_df
y_train = X_train.pop("Survived")
X_train.head()

   Pclass  Sex   Age     Fare  Embarked  Family_size  Title
0       3    0  22.0   7.2500         0            1      0
1       1    1  38.0  71.2833         1            1      1
2       3    1  26.0   7.9250         0            0      2
3       1    1  35.0  53.1000         0            1      1
4       3    0  35.0   8.0500         0            0      0

In [93]:
classifier = LogisticRegression()
classifier.fit(X_train,y_train)
y_pred = classifier.predict(test_df)

In [96]:
from sklearn.metrics import mean_absolute_error
mean = mean_absolute_error(y_true["Survived"],y_pred) 
mean

0.08373205741626795

In [97]:
submission = pd.DataFrame()
submission['PassengerId'] = passenger
submission["Survived"] = y_pred

In [98]:
submission.head(20)

    PassengerId  Survived
0           892         0
1           893         0
2           894         0
3           895         0
4           896         1
5           897         0
6           898         1
7           899         0
8           900         1
9           901         0
10          902         0
11          903         0
12          904         1
13          905         0
14          906         1
15          907         1
16          908         0
17          909         0
18          910         1
19          911         1

In [99]:
submission.to_csv("submission3.csv",index=False)